<center>Myranda Swartzwelter<br>
    DSC-540 T301 Data Preparation<br>
    Week 5 and 6 Assignment: Data Formats, Structures and Sources<br>
    4/24/2022

 Data Wrangling with Python: Activity 7, page 207

In [52]:
#import packages
from bs4 import BeautifulSoup
import pandas as pd

In [8]:
#Read the page using bs4
with open("List of countries by GDP (nominal) - Wikipedia.html", "r") as fd:
    soup = BeautifulSoup(fd)
   # print((soup))

In [12]:
#Find the tables
tables = soup.find_all("table")
print(len(tables)) #There are 9 tables

9

In [31]:
#find the right table
data_tables = soup.find("table", {"class": '"wikitable"|}'})

In [32]:
#sepearate the source name and corresponding data

#separate sources
sources = data_tables.tbody.findAll('tr', recursive=False)[0]
#create source list
sources_list = []
for td in sources.findAll('td'):
    sources_list.append(td)

#get tables
data = data_tables.tbody.findAll('tr', recursive=False)[1].findAll('td', recursive=False)
#create list of tables
data_tables = []
for td in data:
    data_tables.append(td.findAll('table'))

In [33]:
#get source names from the list you created
source_names = []
for source in sources_list:
    #find source name by parsing a tags
    source_names.append(source.findAll('a')[0].getText())

#source_names = [source.findAll('a')[0].getText() for source in sources_list]
print(source_names)

['International Monetary Fund', 'World Bank', 'United Nations']

In [34]:
#separate header and data from previous steps and create dataframe



header1 = [th.getText().strip() for th in data_tables[0][0].findAll('thead')[0].findAll('th')]
header1

['Rank', 'Country', 'GDP(US$MM)']

In [70]:
#First get first row of first table
table1 = data_tables[0][0]

#find the headers
headers = table1.findAll('thead')[0]

#get names
header_names = headers.findAll('th')

#Need to get text out of fields and strip away row end characters
headers = []
for name in header_names:
    headers.append(name.getText().strip())

print(headers)

['Rank', 'Country', 'GDP(US$MM)']

In [71]:
#get table body
table_body = table1.findAll('tbody')[0]
#get rows from body excluding header
table_rows = table_body.findAll('tr')[1:]

#find the data and put it into a list
data_rows = []
for row in table_rows:
     td = row.findAll('td')
     row1 = []
     for td in td:
       # print(td)
        row1.append(td.get_text().strip())
     data_rows.append(row1)
            
#print(data_rows)

In [72]:
df1 = pd.DataFrame(data_rows, columns=headers)
df1.head()

  Rank         Country  GDP(US$MM)
0    1   United States  19,390,600
1    2      China[n 1]  12,014,610
2    3           Japan   4,872,135
3    4         Germany   3,684,816
4    5  United Kingdom   2,624,529

In [73]:
#First get first row of first table
table2 = data_tables[1][0]

#find the headers
headers = table2.findAll('thead')[0]

#get names
header_names = headers.findAll('th')

#Need to get text out of fields and strip away row end characters
headers = []
for name in header_names:
    headers.append(name.getText().strip())

print(headers)

#get table body
table_body = table2.findAll('tbody')[0]
#get rows from body excluding header
table_rows = table_body.findAll('tr')[1:]

#create function to find the correct number to put in table
def find_right_text(i, td):
    #for first 2 colums, no spade
    if i == 0:
        return td.getText().strip()
    elif i == 1:
        return td.getText().strip()
    else:
        #find spade and take secdond half of numbers
        index = td.text.find("â™ ")
        return td.text[index+1:].strip()

#find the data and put it into a list
data_rows = []
for row in table_rows:
     td = row.findAll('td')
     row1 = []
     i = 0
     for td in td:
       # print(td)
        row1.append(find_right_text(i, td))
        i = i+1
     data_rows.append(row1)

#print(data_rows)

df2 = pd.DataFrame(data_rows, columns=headers)
df2.head()

['Rank', 'Country', 'GDP(US$MM)']

  Rank             Country  GDP(US$MM)
0    1       United States  19,390,604
1       European Union[23]  17,277,698
2    2          China[n 4]  12,237,700
3    3               Japan   4,872,137
4    4             Germany   3,677,439

In [74]:
#First get first row of first table
table3 = data_tables[2][0]

#find the headers
headers = table3.findAll('thead')[0]

#get names
header_names = headers.findAll('th')

#Need to get text out of fields and strip away row end characters
headers = []
for name in header_names:
    headers.append(name.getText().strip())

print(headers)

#get table body
table_body = table3.findAll('tbody')[0]
#get rows from body excluding header
table_rows = table_body.findAll('tr')[1:]

#find the data and put it into a list
data_rows = []
for row in table_rows:
     td = row.findAll('td')
     row1 = []
     i = 0
     for td in td:
       # print(td)
        row1.append(find_right_text(i, td))
        i = i+1
     data_rows.append(row1)
            
#print(data_rows)

#put rows and headers into dataframe
df3 = pd.DataFrame(data_rows, columns=headers)
df3.head()

['Rank', 'Country', 'GDP(US$MM)']

  Rank         Country  GDP(US$MM)
0    1   United States  18,624,475
1    2      China[n 4]  11,218,281
2    3           Japan   4,936,211
3    4         Germany   3,477,796
4    5  United Kingdom   2,647,898

Data Wrangling with Python: Activity 8, page 233

In [97]:
#import packages
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [77]:
#read csv
visit_data = pd.read_csv("visit_data.csv")
visit_data.head()

,id,first_name,last_name,email,gender,ip_address,visit
0,1,Sonny,Dahl,sdahl0@mysql.com,Male,135.36.96.183,1225.0
1,2,NaN,NaN,dhoovart1@hud.gov,NaN,237.165.194.143,919.0
2,3,Gar,Armal,garmal2@technorati.com,NaN,166.43.137.224,271.0
3,4,Chiarra,Nulty,cnulty3@newyorker.com,NaN,139.98.137.108,1002.0
4,5,NaN,NaN,sleaver4@elegantthemes.com,NaN,46.117.117.27,2434.0

In [88]:
#check for duplicates

#first name duplicates
fn_dupes = visit_data.first_name.duplicated().any()
print('First name duplicates: ', fn_dupes)

#last name duplicates
ln_dupes = any(visit_data.last_name.duplicated())
print('Last name duplicates: ', ln_dupes)

#email  duplicates
email_dupes = any(visit_data.email.duplicated())
print('Email duplicates: ', email_dupes)

#gender  duplicates
gender_dupes = any(visit_data.gender.duplicated())
print('Gender duplicates: ', gender_dupes)

#ip_address   duplicates
ip_dupes = any(visit_data.ip_address.duplicated())
print('IP duplicates: ', ip_dupes)

#visit   duplicates
visit_dupes = any(visit_data.visit.duplicated())
print('Visit duplicates: ', visit_dupes)

First name duplicates:  True
Last name duplicates:  True
Email duplicates:  False
Gender duplicates:  True
IP duplicates:  False
Visit duplicates:  True

In [92]:
#check for NaN

#first name Nulls
fn_nan = visit_data.first_name.isnull().values.any()
print('First name Nulls: ', fn_nan)

#last name Nulls
ln_nan = visit_data.last_name.isnull().values.any()
print('Last name Nulls: ', ln_nan)

#email  Nulls
email_nan = visit_data.email.isnull().values.any()
print('Email Nulls: ', email_nan)

#gender  Nulls
gender_nan = visit_data.gender.isnull().values.any()
print('Gender Nulls: ', gender_nan)

#ip_address   Nulls
ip_nan = visit_data.ip_address.isnull().values.any()
print('IP Nulls: ', ip_nan)

#visit   Nulls
visit_nan = visit_data.visit.isnull().values.any()
print('Visit Nulls: ', visit_nan)

First name Nulls:  True
Last name Nulls:  True
Email Nulls:  False
Gender Nulls:  True
IP Nulls:  False
Visit Nulls:  True

In [100]:
#Since there are nulls in the visit field, and this is field we would create a model for, we consider these 
# outliers

#Remove the outliers
visit_data_no_outliers = visit_data[np.isfinite(visit_data['visit'])]

(1000, 7)
(974, 7)

In [103]:
#Report the difference in size
#size of original dataframe
orig_size = visit_data.shape

#size of new dataframe
new_size = visit_data_no_outliers.shape

#calculate difference
diff = orig_size[0] - new_size[0]
print('The difference in size is',diff)

(1000, 7)
(974, 7)
The difference in size is 26